Repository: Amr-244/Pneumonia_Detection
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Welcome!
ar: مرحبًا!

# description
source: Detect pneumonia early using AI and chest X-ray analysis
ar: اكتشف الالتهاب الرئوي مبكرًا باستخدام الذكاء الاصطناعي وتحليل أشعة الصدر

# upload
source: Upload X-ray Image
ar: تحميل صورة الأشعة

source: Check Result
ar: عرض النتيجة

source: Reset
ar: إعادة تعيين

# scan
source: Scan X-ray
ar: امسح صورة الأشعة

# app_title
source: Pneumonia Detector
ar: كاشف الالتهاب الرئوي

# intro
source: Introduction
ar: مقدمة

# chatbot
source: Chatbot Assistant
ar: المساعد الذكي

source: Language
ar: اللغة

# rate
source: Rate This App
ar: قيّم هذا التطبيق

# dark_mode_toggle
source: Toggle Dark Mode
ar: تبديل الوضع الداكن

source: ❗ Pneumonia Detected
ar: ❗ تم اكتشاف التهاب رئوي

# no_pneumonia
source: ✅ No Pneumonia Detected
ar: ✅ لا يوجد التهاب رئوي

# about_app
source: About the App
ar: عن التطبيق

# why_app_matters
source: Why This App Matters
ar: أهمية هذا التطبيق

# why_app_text
source: This app helps detect pneumonia early using AI image analysis. It empowers patients and supports healthcare workers with fast, accessible, and reliable insights.
ar: يساعد هذا التطبيق في اكتشاف الالتهاب الرئوي مبكرًا باستخدام تحليل الصور بالذكاء الاصطناعي. يدعم المرضى ويعزز قدرات العاملين في المجال الصحي.

source: Key Features
ar: الميزات الرئيسية

# feature_ai_detection
source: AI-based detection from chest X-rays
ar: اكتشاف يعتمد على الذكاء الاصطناعي من صور الأشعة

# feature_chatbot
source: Chatbot assistant for health guidance
ar: مساعد دردشة لتقديم الإرشادات الصحية

# feature_multilingual
source: Multilingual support: English, Arabic, French
ar: دعم لعدة لغات: العربية، الإنجليزية، الفرنسية

# feature_dark_mode
source: Dark mode for comfort
ar: الوضع الليلي للراحة

# feature_education
source: Educational content to raise awareness
ar: محتوى توعوي لرفع الوعي الصحي

source: What is Pneumonia?
ar: ما هو الالتهاب الرئوي؟

# pneumonia_description
source: Pneumonia is a lung infection that inflames air sacs (alveoli), causing them to fill with fluid or pus.
ar: الالتهاب الرئوي هو عدوى تصيب الرئتين وتسبب التهاب الحويصلات الهوائية وامتلاءها بالسوائل أو القيح.

# common_symptoms
source: Common symptoms include:
ar: الأعراض الشائعة تشمل:

# symptom_cough
source: Cough and chest pain
ar: السعال وألم في الصدر

# symptom_fever
source: Fever and chills
ar: الحمى والقشعريرة

# symptom_breath
source: Shortness of breath
ar: ضيق في التنفس

# symptom_fatigue
source: Fatigue and confusion (especially in elderly)
ar: الإرهاق والارتباك (خاصة لدى كبار السن)

# how_to_prevent
source: How to Prevent It?
ar: كيف يمكن الوقاية؟

# prevent_vaccine
source: Get vaccinated (flu & pneumonia shots)
ar: الحصول على التطعيمات (الإنفلونزا والالتهاب الرئوي)

# prevent_hygiene
source: Wash your hands frequently
ar: اغسل يديك بشكل متكرر

# prevent_smoke
source: Avoid smoking and air pollution
ar: تجنب التدخين وتلوث الهواء

# prevent_nutrition
source: Eat healthy to boost your immunity
ar: تناول غذاء صحي لدعم المناعة

# prevent_early_care
source: Seek medical care early if symptoms appear
ar: اطلب الرعاية الطبية مبكرًا عند ظهور الأعراض

# early_diagnosis
source: 🌟 Early diagnosis saves lives!
ar: 🌟 التشخيص المبكر ينقذ الأرواح!

# chat_hint
source: Say something...
ar: اكتب شيئًا...

source: Typing...
ar: يكتب...

# bot_unknown
source: 🤖 Sorry, I didn't understand that.
ar: 🤖 عذرًا، لم أفهم ذلك.

source: Server error
ar: خطأ في الخادم

# connection_error
source: Failed to connect to Gemini API.
ar: فشل الاتصال بـ Gemini API.

# copied
source: Copied to clipboard ✅
ar: تم النسخ ✅

# bot_watermark
source: BOT TO HELP
ar: مساعد ذكي

# feedback_title
source: We value your feedback!
ar: نقدّر ملاحظاتك!

# feedback_subtitle
source: Please rate this app to help us improve.
ar: يرجى تقييم التطبيق لمساعدتنا على التحسين.

# submit
source: Submit Rating
ar: إرسال التقييم

# thank_you_feedback
source: Thank you for your feedback!
ar: شكرًا على ملاحظاتك!

# thank_you_rating
source: Thank you for rating {count} star(s)!
ar: شكرًا لتقييمك بـ {count} نجمة!

# select_language
source: Select your preferred language:
ar: اختر لغتك المفضلة:

source: Save Language
ar: حفظ اللغة

source: Language saved ✅
ar: تم حفظ اللغة ✅
